<meta http-equiv='refresh' content='3; url=http://neurallery.com/'>
<meta charset="UTF-8" />
<?php
//Получаем данные из глобальной переменной $_GET, так как мы передаем данные методом GET
//$name = $_GET['name']; // Вытаскиваем имя в переменную
$email = $_GET['e-mail']; // Вытаскиваем почту в переменную
$message = "Сообщение от\r\n$email."; // Формируем сообщение, отправляемое на почту
$to = 'fisher140@yandex.ru'; // Задаем получателя письма

$from = "neurallery.com"; // От кого пришло письмо

$subject = "Письмо с формы сайта http://neurallery.com/"; // Задаем тему письма

$headers = "From: $from\r\nReply-To: $to\r\nContent-type: text/html; charset=utf-8\r\n"; // Формируем заголовок письма (при неправильном формировании может ломаться кодировка и т.д.)

IF (mail($to, $subject, $message, $headers)) { // При помощи функции mail, отправляем сообщение, проверяя отправилось оно или нет
echo "<p>Сообщение успешно отправлено</p>"; // Отправка успешна
}
ELSE {
echo "<p>Что-то пошло не так, как планировалось</p>"; // Письмо не отправилось
}
?>
